<a href="https://colab.research.google.com/github/FlorLaReinaMunoz/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Flor_Munoz_DSPT6_Unit1_Sprint1_Mod3_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-18 23:00:27--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.89.53
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.89.53|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  52.3MB/s    in 3.8s

2020-03-18 23:00:31 (52.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [6]:
# First, write down which columns you need and which dataframes have them.
'''Banana Bag of Organic Bananas Organic Strawberries Organic Baby Spinach 
Organic Hass Avocado Organic Avocado Large Lemon Strawberries Limes
Organic Whole Milk'''
#I would assume we could find these in products.csv
#and if we want to know how many times it was ordered, that should be in order_products__prior.csv 
#So we need a common column to get this down to something we can work with

'Banana Bag of Organic Bananas Organic Strawberries Organic Baby Spinach \nOrganic Hass Avocado Organic Avocado Large Lemon Strawberries Limes\nOrganic Whole Milk'

In [7]:
import numpy as np
import pandas as pd
products_df=pd.read_csv('products.csv')
print(products_df.shape)
products_df.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [35]:
#lets get rid of the products that we don't need
'''Banana Bag of Organic Bananas Organic Strawberries Organic Baby Spinach Organic Hass Avocado Organic Avocado Large Lemon Strawberries Limes Organic Whole Milk'''
shopping = products_df[(products_df['product_name']=='Banana') | (products_df['product_name']=='Bag of Organic Bananas') | (products_df['product_name']=='Organic Strawberries') | (products_df['product_name']=='Organic Baby Spinach') | (products_df['product_name']=='Organic Hass Avocado') | (products_df['product_name']=='Organic Avocado') | (products_df['product_name']=='Large Lemon') | (products_df['product_name']=='Strawberries') | (products_df['product_name']=='Limes') | (products_df['product_name']=='Organic Whole Milk') ]
print(shopping.shape)
shopping

(10, 4)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [8]:
orders_df=pd.read_csv('order_products__prior.csv')
print(orders_df.shape)
orders_df.head()
#so the common column is product ID, but we also have to add the
#order_products__train because we aren't making a learning model.
#We are answering a simple question about purchases

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
orders2_df=pd.read_csv('order_products__train.csv')
print(orders2_df.shape)
orders2_df.head()
#looks like of all 3 data bases we only need orderID, productID, add to cart reordered and product name

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [41]:
#there are extra cols in the products we don't need so those need dropped
cols=['product_id', 'product_name']
shopping = shopping[cols]
print(shopping.shape)
shopping.head(10)

(10, 2)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [11]:
#need to merge the two orders datasets
totorders_df=orders_df+orders2_df
print(totorders_df.shape)
totorders_df.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0       3.0     82422.0                2.0        2.0
1       3.0     40094.0                4.0        2.0
2       3.0     19573.0                6.0        0.0
3       3.0     95601.0                8.0        1.0
4       3.0     73668.0               10.0        1.0

In [40]:
#we don't need the reordered col, so let's drop that
cols=['order_id','product_id', 'add_to_cart_order']
totorders_df = totorders_df[cols]
print(totorders_df.shape)
totorders_df.head()

(32434489, 3)

   order_id  product_id  add_to_cart_order
0       3.0     82422.0                2.0
1       3.0     40094.0                4.0
2       3.0     19573.0                6.0
3       3.0     95601.0                8.0
4       3.0     73668.0               10.0

In [44]:
#lets get rid of all the product IDs that don't match the 10 we need
ourlist = totorders_df[(totorders_df['product_id']==13176) |
                       (totorders_df['product_id']==16797) | 
                       (totorders_df['product_id']==21137) |
                       (totorders_df['product_id']==21903) | 
                       (totorders_df['product_id']==24852) | 
                       (totorders_df['product_id']==26209) | 
                       (totorders_df['product_id']==27845) | 
                       (totorders_df['product_id']==47209) | 
                       (totorders_df['product_id']==47626) | 
                       (totorders_df['product_id']==47766) ]
print(ourlist.shape)
ourlist.head()

(184, 3)

       order_id  product_id  add_to_cart_order
8461    21195.0     47626.0                4.0
12840   32368.0     27845.0               15.0
18221   46159.0     26209.0               10.0
26629   67533.0     26209.0               21.0
28199   71526.0     47626.0               28.0

In [45]:
#now to merge with the products
master_df=pd.merge(ourlist, shopping, on='product_id', how='outer')
print(master_df.shape)
master_df.head()

(184, 4)

   order_id  product_id  add_to_cart_order product_name
0   21195.0     47626.0                4.0  Large Lemon
1   71526.0     47626.0               28.0  Large Lemon
2  263637.0     47626.0               11.0  Large Lemon
3  310187.0     47626.0                8.0  Large Lemon
4  312086.0     47626.0                5.0  Large Lemon

In [47]:
master_df['product_name'].value_counts()

Large Lemon               40
Organic Avocado           35
Organic Hass Avocado      23
Organic Whole Milk        20
Limes                     18
Bag of Organic Bananas    11
Banana                    11
Organic Strawberries      10
Organic Baby Spinach       9
Strawberries               7
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [48]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [51]:
# table2 -> tidy
tidy2 = table2.melt(id_vars = 'index',
                       value_vars = ['treatmenta', 'treatmentb']
                       )

KeyError: ignored

In [0]:
# tidy -> table2

In [0]:
flights = sns.load_dataset('flights')

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####